Tekla Open API Reference for Tekla Structures 2025
Operation.ProgressBar.SetProgress Method
 Update status information on the progress bar.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetProgress(
	string ProgressLabel,
	int Progress
)
Public Sub SetProgress (
	ProgressLabel As String,
	Progress As Integer
)
Parameters
ProgressLabel
Type: System.String
Bar label text.
Progress
Type: System.Int32
Progess, number between 0..100
See Also
Reference
Operation.ProgressBar Class
Tekla.Structures.Model.Operations Namespace